In [1]:
people = {
    "first" : ["Jane", "John", "Tommy", "Adam"],
    "last" : ["doe", "doe", "White", "Doe"],
    "email" : ["janedoe@gmail.com", "johndoe@gmail.com", "tommy@yahoo.com", "a.email.com"]
}

In [2]:
people['first']

['Jane', 'John', 'Tommy', 'Adam']

In [3]:
import pandas as pd

In [4]:
df = pd.DataFrame(people)

In [5]:
df

   first   last              email
0   Jane    doe  janedoe@gmail.com
1   John    doe  johndoe@gmail.com
2  Tommy  White    tommy@yahoo.com
3   Adam    Doe        a.email.com

In [6]:
df[['first', 'email']]

   first              email
0   Jane  janedoe@gmail.com
1   John  johndoe@gmail.com
2  Tommy    tommy@yahoo.com
3   Adam        a.email.com

In [7]:
type(df['email'])

pandas.core.series.Series

In [8]:
df.columns

Index(['first', 'last', 'email'], dtype='object')

In [9]:
df.iloc[[0, 1]]

  first last              email
0  Jane  doe  janedoe@gmail.com
1  John  doe  johndoe@gmail.com

In [10]:
df

   first   last              email
0   Jane    doe  janedoe@gmail.com
1   John    doe  johndoe@gmail.com
2  Tommy  White    tommy@yahoo.com
3   Adam    Doe        a.email.com

In [11]:
df.loc[[0, 1], ['first', 'email']]

  first              email
0  Jane  janedoe@gmail.com
1  John  johndoe@gmail.com

In [12]:
df

   first   last              email
0   Jane    doe  janedoe@gmail.com
1   John    doe  johndoe@gmail.com
2  Tommy  White    tommy@yahoo.com
3   Adam    Doe        a.email.com

In [13]:
df['last'] == "doe"

0     True
1     True
2    False
3    False
Name: last, dtype: bool

In [14]:
df

   first   last              email
0   Jane    doe  janedoe@gmail.com
1   John    doe  johndoe@gmail.com
2  Tommy  White    tommy@yahoo.com
3   Adam    Doe        a.email.com

In [15]:
filt = (df['last'] == 'doe') & (df['first'] == 'Jane') # filter | Print email's that are equal to ... 
my_filter = (df['last'] == 'White') & (df['first'] == 'Tommy')

In [16]:
df[filt] # print the data frame of "filt"
df.loc[my_filter, ['last', 'first']]

    last  first
2  White  Tommy

In [17]:
df.loc[filt, ['last', 'email']] # print the data frame of "filt" by location .

  last              email
0  doe  janedoe@gmail.com

In [18]:
tommy = df.loc[my_filter, ['first', 'last']]

In [19]:
tommy

   first   last
2  Tommy  White

In [20]:
filt = (df['last'] != 'doe') & (df['first'] != 'Jane')

In [21]:
df[~filt]

  first last              email
0  Jane  doe  janedoe@gmail.com
1  John  doe  johndoe@gmail.com

In [22]:
df['email'] = df['email'].str.lower()

In [23]:
df

   first   last              email
0   Jane    doe  janedoe@gmail.com
1   John    doe  johndoe@gmail.com
2  Tommy  White    tommy@yahoo.com
3   Adam    Doe        a.email.com

In [24]:
df['email'].apply(len)

0    17
1    17
2    15
3    11
Name: email, dtype: int64

In [25]:
df['email'].apply(lambda x: x.lower())

0    janedoe@gmail.com
1    johndoe@gmail.com
2      tommy@yahoo.com
3          a.email.com
Name: email, dtype: object

In [26]:
df['email'] = df['email'].apply(lambda x: x.lower())

In [27]:
df

   first   last              email
0   Jane    doe  janedoe@gmail.com
1   John    doe  johndoe@gmail.com
2  Tommy  White    tommy@yahoo.com
3   Adam    Doe        a.email.com

In [28]:
df.apply(len, axis='columns')

0    3
1    3
2    3
3    3
dtype: int64

In [29]:
len(df['email'])

4

In [30]:
df.apply(lambda x: x.max())

first              Tommy
last                 doe
email    tommy@yahoo.com
dtype: object

In [31]:
df.applymap(len)

   first  last  email
0      4     3     17
1      4     3     17
2      5     5     15
3      4     3     11

In [32]:
df = df.applymap(lambda x: x.lower())

In [33]:
df

   first   last              email
0   jane    doe  janedoe@gmail.com
1   john    doe  johndoe@gmail.com
2  tommy  white    tommy@yahoo.com
3   adam    doe        a.email.com

In [34]:
df['first'] + ' ' + df['last'] + ' and the email is: ' + df['email']

0     jane doe and the email is: janedoe@gmail.com
1     john doe and the email is: johndoe@gmail.com
2    tommy white and the email is: tommy@yahoo.com
3           adam doe and the email is: a.email.com
dtype: object

In [35]:
df['full_name'] = df['first'] + ' ' + df['last']

In [36]:
df

   first   last              email    full_name
0   jane    doe  janedoe@gmail.com     jane doe
1   john    doe  johndoe@gmail.com     john doe
2  tommy  white    tommy@yahoo.com  tommy white
3   adam    doe        a.email.com     adam doe

In [37]:
df.drop(columns=['first','last'], inplace=True)

In [38]:
df

               email    full_name
0  janedoe@gmail.com     jane doe
1  johndoe@gmail.com     john doe
2    tommy@yahoo.com  tommy white
3        a.email.com     adam doe

In [39]:
df['full_name'].str.split(' ')

0       [jane, doe]
1       [john, doe]
2    [tommy, white]
3       [adam, doe]
Name: full_name, dtype: object

In [40]:
df['full_name'].str.split(' ', expand=True)

       0      1
0   jane    doe
1   john    doe
2  tommy  white
3   adam    doe

In [41]:
df[['first','last']] = df['full_name'].str.split(' ', expand=True)

In [42]:
df

               email    full_name  first   last
0  janedoe@gmail.com     jane doe   jane    doe
1  johndoe@gmail.com     john doe   john    doe
2    tommy@yahoo.com  tommy white  tommy  white
3        a.email.com     adam doe   adam    doe

In [43]:
df.drop(columns={'full_name'})

               email  first   last
0  janedoe@gmail.com   jane    doe
1  johndoe@gmail.com   john    doe
2    tommy@yahoo.com  tommy  white
3        a.email.com   adam    doe

In [44]:
df.append({'first':'tarokh'}, ignore_index=True)

               email    full_name   first   last
0  janedoe@gmail.com     jane doe    jane    doe
1  johndoe@gmail.com     john doe    john    doe
2    tommy@yahoo.com  tommy white   tommy  white
3        a.email.com     adam doe    adam    doe
4                NaN          NaN  tarokh    NaN

In [45]:
users = {
    "first" : ["Tony", "tarokh"],
    "last" : ["stark", "yaghoubi"],
    "email" : ["mrstark@gmail.com", "tarokh@gmail.com"]
}

df2 = pd.DataFrame(users)

In [46]:
df2

    first      last              email
0    Tony     stark  mrstark@gmail.com
1  tarokh  yaghoubi   tarokh@gmail.com

In [47]:
df.append(df2, ignore_index=True, sort=False)

               email    full_name   first      last
0  janedoe@gmail.com     jane doe    jane       doe
1  johndoe@gmail.com     john doe    john       doe
2    tommy@yahoo.com  tommy white   tommy     white
3        a.email.com     adam doe    adam       doe
4  mrstark@gmail.com          NaN    Tony     stark
5   tarokh@gmail.com          NaN  tarokh  yaghoubi

In [48]:
df = df.append(df2, ignore_index=True, sort=False)

In [49]:
df

               email    full_name   first      last
0  janedoe@gmail.com     jane doe    jane       doe
1  johndoe@gmail.com     john doe    john       doe
2    tommy@yahoo.com  tommy white   tommy     white
3        a.email.com     adam doe    adam       doe
4  mrstark@gmail.com          NaN    Tony     stark
5   tarokh@gmail.com          NaN  tarokh  yaghoubi

In [50]:
df.drop(index=4)

               email    full_name   first      last
0  janedoe@gmail.com     jane doe    jane       doe
1  johndoe@gmail.com     john doe    john       doe
2    tommy@yahoo.com  tommy white   tommy     white
3        a.email.com     adam doe    adam       doe
5   tarokh@gmail.com          NaN  tarokh  yaghoubi

In [51]:
df.drop(index=4, inplace=True)

In [52]:
filt = df['last'] == 'doe'
df.drop(index=df[filt].index) # drop the rows with a condition

              email    full_name   first      last
2   tommy@yahoo.com  tommy white   tommy     white
5  tarokh@gmail.com          NaN  tarokh  yaghoubi

In [53]:
# Sorting Data

In [54]:
df.sort_values(by='last', ascending=False)

               email    full_name   first      last
5   tarokh@gmail.com          NaN  tarokh  yaghoubi
2    tommy@yahoo.com  tommy white   tommy     white
0  janedoe@gmail.com     jane doe    jane       doe
1  johndoe@gmail.com     john doe    john       doe
3        a.email.com     adam doe    adam       doe

In [55]:
df.sort_values(by=['last','first'], ascending=False)

               email    full_name   first      last
5   tarokh@gmail.com          NaN  tarokh  yaghoubi
2    tommy@yahoo.com  tommy white   tommy     white
1  johndoe@gmail.com     john doe    john       doe
0  janedoe@gmail.com     jane doe    jane       doe
3        a.email.com     adam doe    adam       doe

In [58]:
df = df.drop(columns={'full_name'})

In [59]:
df

               email   first      last
0  janedoe@gmail.com    jane       doe
1  johndoe@gmail.com    john       doe
2    tommy@yahoo.com   tommy     white
3        a.email.com    adam       doe
5   tarokh@gmail.com  tarokh  yaghoubi

In [61]:
df.sort_values(by=['first','last'], ascending=[True, False], inplace=True)

In [62]:
df

               email   first      last
3        a.email.com    adam       doe
0  janedoe@gmail.com    jane       doe
1  johndoe@gmail.com    john       doe
5   tarokh@gmail.com  tarokh  yaghoubi
2    tommy@yahoo.com   tommy     white

In [63]:
df.sort_index()

               email   first      last
0  janedoe@gmail.com    jane       doe
1  johndoe@gmail.com    john       doe
2    tommy@yahoo.com   tommy     white
3        a.email.com    adam       doe
5   tarokh@gmail.com  tarokh  yaghoubi

In [64]:
df['first'].sort_values()

3      adam
0      jane
1      john
5    tarokh
2     tommy
Name: first, dtype: object